-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th10 18, 2024 lúc 07:49 PM
-- Phiên bản máy phục vụ: 10.4.10-MariaDB
-- Phiên bản PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `gold`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `gold_prices`
--

CREATE TABLE `gold_prices` (
  `id` int(11) NOT NULL,
  `area` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `type` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `buy` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `sell` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `date` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `gold_prices`
--

INSERT INTO `gold_prices` (`id`, `area`, `type`, `buy`, `sell`, `date`) VALUES
(1, 'TPHCM', 'PNJ', '87.600', '88.890', '2024-11-15'),
(2, 'TPHCM', 'SJC', '87.000', '89.000', '2024-11-15'),
(3, 'Hà Nội', 'PNJ', '87.600', '88.890', '2024-11-15'),
(4, 'Hà Nội', 'SJC', '87.000', '89.000', '2024-11-15'),
(5, 'Đà Nẵng', 'PNJ', '87.600', '88.890', '2024-11-15'),
(6, 'Đà Nẵng', 'SJC', '87.000', '89.000', '2024-11-15'),
(7, 'Miền Tây', 'PNJ', '87.600', '88.890', '2024-11-15'),
(8, 'Miền Tây', 'SJC', '87.000', '89.000', '2024-11-15'),
(9, 'Tây Nguyên', 'PNJ', '87.600', '88.890', '2024-11-15'),
(10, 'Tây Nguyên', 'SJC', '87.000', '89.000', '2024-11-15'),
(11, 'Đông Nam Bộ', 'PNJ', '87.600', '88.890', '2024-11-15'),
(12, 'Đông Nam Bộ', 'SJC', '87.000', '89.000', '2024-11-15'),
(13, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '87.600', '88.890', '2024-11-15'),
(14, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '87.500', '88.300', '2024-11-15'),
(15, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '87.410', '88.210', '2024-11-15'),
(16, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '86.520', '87.520', '2024-11-15'),
(17, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '80.480', '80.980', '2024-11-15'),
(18, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '64.980', '66.380', '2024-11-15'),
(19, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '58.790', '60.190', '2024-11-15'),
(20, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '56.150', '57.550', '2024-11-15'),
(21, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '52.610', '54.010', '2024-11-15'),
(22, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '50.410', '51.810', '2024-11-15'),
(23, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '35.480', '36.880', '2024-11-15'),
(24, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '31.860', '33.260', '2024-11-15'),
(25, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '27.890', '29.290', '2024-11-15'),
(26, 'TPHCM', 'PNJ', '78.900', '82.600', '2024-11-16'),
(27, 'TPHCM', 'SJC', '79.000', '83.500', '2024-11-16'),
(28, 'Hà Nội', 'PNJ', '81.900', '82.600', '2024-11-16'),
(29, 'Hà Nội', 'SJC', '82.000', '83.500', '2024-11-16'),
(30, 'Đà Nẵng', 'PNJ', '81.900', '82.600', '2024-11-16'),
(31, 'Đà Nẵng', 'SJC', '80.000', '83.500', '2024-11-16'),
(32, 'Miền Tây', 'PNJ', '80.900', '82.600', '2024-11-16'),
(33, 'Miền Tây', 'SJC', '80.000', '83.500', '2024-11-16'),
(34, 'Tây Nguyên', 'PNJ', '80.900', '82.600', '2024-11-16'),
(35, 'Tây Nguyên', 'SJC', '80.000', '83.500', '2024-11-16'),
(36, 'Đông Nam Bộ', 'PNJ', '80.900', '82.600', '2024-11-16'),
(37, 'Đông Nam Bộ', 'SJC', '80.000', '83.500', '2024-11-16'),
(38, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '80.900', '82.600', '2024-11-16'),
(39, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '80.800', '81.600', '2024-11-16'),
(40, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '80.720', '81.520', '2024-11-16'),
(41, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '79.880', '80.880', '2024-11-16'),
(42, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '74.350', '74.850', '2024-11-16'),
(43, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '59.950', '61.350', '2024-11-16'),
(44, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '54.240', '55.640', '2024-11-16'),
(45, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '51.790', '53.190', '2024-11-16'),
(46, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '48.530', '49.930', '2024-11-16'),
(47, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '46.490', '47.890', '2024-11-16'),
(48, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '32.700', '34.100', '2024-11-16'),
(49, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '29.350', '30.750', '2024-11-16'),
(50, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '25.680', '27.080', '2024-11-16'),
(51, 'TPHCM', 'PNJ', '80.800', '82.600', '2024-11-17'),
(52, 'TPHCM', 'SJC', '80.100', '83.500', '2024-11-17'),
(53, 'Hà Nội', 'PNJ', '80.200', '82.600', '2024-11-17'),
(54, 'Hà Nội', 'SJC', '80.100', '83.500', '2024-11-17'),
(55, 'Đà Nẵng', 'PNJ', '80.900', '82.600', '2024-11-17'),
(56, 'Đà Nẵng', 'SJC', '80.000', '83.500', '2024-11-17'),
(57, 'Miền Tây', 'PNJ', '80.900', '82.600', '2024-11-17'),
(58, 'Miền Tây', 'SJC', '80.000', '83.500', '2024-11-17'),
(59, 'Tây Nguyên', 'PNJ', '80.900', '82.600', '2024-11-17'),
(60, 'Tây Nguyên', 'SJC', '80.000', '83.500', '2024-11-17'),
(61, 'Đông Nam Bộ', 'PNJ', '80.900', '82.600', '2024-11-17'),
(62, 'Đông Nam Bộ', 'SJC', '80.000', '83.500', '2024-11-17'),
(63, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '80.900', '82.600', '2024-11-17'),
(64, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '80.800', '81.600', '2024-11-17'),
(65, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '80.720', '81.520', '2024-11-17'),
(66, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '79.880', '80.880', '2024-11-17'),
(67, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '74.350', '74.850', '2024-11-17'),
(68, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '59.950', '61.350', '2024-11-17'),
(69, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '54.240', '55.640', '2024-11-17'),
(70, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '51.790', '53.190', '2024-11-17'),
(71, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '48.530', '49.930', '2024-11-17'),
(72, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '46.490', '47.890', '2024-11-17'),
(73, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '32.700', '34.100', '2024-11-17'),
(74, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '29.350', '30.750', '2024-11-17'),
(75, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '25.680', '27.080', '2024-11-17'),
(76, 'TPHCM', 'PNJ', '80.900', '82.600', '2024-11-18'),
(77, 'TPHCM', 'SJC', '80.000', '83.500', '2024-11-18'),
(78, 'Hà Nội', 'PNJ', '80.900', '82.600', '2024-11-18'),
(79, 'Hà Nội', 'SJC', '80.000', '83.500', '2024-11-18'),
(80, 'Đà Nẵng', 'PNJ', '80.900', '82.600', '2024-11-18'),
(81, 'Đà Nẵng', 'SJC', '80.000', '83.500', '2024-11-18'),
(82, 'Miền Tây', 'PNJ', '80.900', '82.600', '2024-11-18'),
(83, 'Miền Tây', 'SJC', '80.000', '83.500', '2024-11-18'),
(84, 'Tây Nguyên', 'PNJ', '80.900', '82.600', '2024-11-18'),
(85, 'Tây Nguyên', 'SJC', '80.000', '83.500', '2024-11-18'),
(86, 'Đông Nam Bộ', 'PNJ', '80.900', '82.600', '2024-11-18'),
(87, 'Đông Nam Bộ', 'SJC', '80.000', '83.500', '2024-11-18'),
(88, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '80.900', '82.600', '2024-11-18'),
(89, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '80.800', '81.600', '2024-11-18'),
(90, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '80.720', '81.520', '2024-11-18'),
(91, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '79.880', '80.880', '2024-11-18'),
(92, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '74.350', '74.850', '2024-11-18'),
(93, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '59.950', '61.350', '2024-11-18'),
(94, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '54.240', '55.640', '2024-11-18'),
(95, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '51.790', '53.190', '2024-11-18'),
(96, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '48.530', '49.930', '2024-11-18'),
(97, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '46.490', '47.890', '2024-11-18'),
(98, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '32.700', '34.100', '2024-11-18'),
(99, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '29.350', '30.750', '2024-11-18'),
(100, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '25.680', '27.080', '2024-11-18'),
(101, 'TPHCM', 'PNJ', '81.800', '83.200', '2024-11-19'),
(102, 'TPHCM', 'SJC', '81.000', '84.000', '2024-11-19'),
(103, 'Hà Nội', 'PNJ', '81.800', '83.200', '2024-11-19'),
(104, 'Hà Nội', 'SJC', '81.000', '84.000', '2024-11-19'),
(105, 'Đà Nẵng', 'PNJ', '81.800', '83.200', '2024-11-19'),
(106, 'Đà Nẵng', 'SJC', '81.000', '84.000', '2024-11-19'),
(107, 'Miền Tây', 'PNJ', '81.800', '83.200', '2024-11-19'),
(108, 'Miền Tây', 'SJC', '81.000', '84.000', '2024-11-19'),
(109, 'Tây Nguyên', 'PNJ', '81.800', '83.200', '2024-11-19'),
(110, 'Tây Nguyên', 'SJC', '81.000', '84.000', '2024-11-19'),
(111, 'Đông Nam Bộ', 'PNJ', '81.800', '83.200', '2024-11-19'),
(112, 'Đông Nam Bộ', 'SJC', '81.000', '84.000', '2024-11-19'),
(113, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '81.800', '83.200', '2024-11-19'),
(114, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '81.700', '82.500', '2024-11-19'),
(115, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '81.620', '82.420', '2024-11-19'),
(116, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '80.780', '81.780', '2024-11-19'),
(117, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '75.170', '75.670', '2024-11-19'),
(118, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '60.630', '62.030', '2024-11-19'),
(119, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '54.850', '56.250', '2024-11-19'),
(120, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '52.380', '53.780', '2024-11-19'),
(121, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '49.080', '50.480', '2024-11-19'),
(122, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '47.010', '48.410', '2024-11-19'),
(123, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '33.070', '34.470', '2024-11-19'),
(124, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '29.690', '31.090', '2024-11-19'),
(125, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '25.980', '27.380', '2024-11-19'),
(126, 'TPHCM', 'PNJ', '81.800', '83.200', '2024-11-19'),
(127, 'TPHCM', 'SJC', '81.000', '84.000', '2024-11-19'),
(128, 'Hà Nội', 'PNJ', '81.800', '83.200', '2024-11-19'),
(129, 'Hà Nội', 'SJC', '81.000', '84.000', '2024-11-19'),
(130, 'Đà Nẵng', 'PNJ', '81.800', '83.200', '2024-11-19'),
(131, 'Đà Nẵng', 'SJC', '81.000', '84.000', '2024-11-19'),
(132, 'Miền Tây', 'PNJ', '81.800', '83.200', '2024-11-19'),
(133, 'Miền Tây', 'SJC', '81.000', '84.000', '2024-11-19'),
(134, 'Tây Nguyên', 'PNJ', '81.800', '83.200', '2024-11-19'),
(135, 'Tây Nguyên', 'SJC', '81.000', '84.000', '2024-11-19'),
(136, 'Đông Nam Bộ', 'PNJ', '81.800', '83.200', '2024-11-19'),
(137, 'Đông Nam Bộ', 'SJC', '81.000', '84.000', '2024-11-19'),
(138, 'Giá vàng nữ trang', 'Nhẫn Trơn PNJ 999.9', '81.800', '83.200', '2024-11-19'),
(139, 'Giá vàng nữ trang', 'Vàng nữ trang 999.9', '81.700', '82.500', '2024-11-19'),
(140, 'Giá vàng nữ trang', 'Vàng nữ trang 999', '81.620', '82.420', '2024-11-19'),
(141, 'Giá vàng nữ trang', 'Vàng nữ trang 99', '80.780', '81.780', '2024-11-19'),
(142, 'Giá vàng nữ trang', 'Vàng 916 (22K)', '75.170', '75.670', '2024-11-19'),
(143, 'Giá vàng nữ trang', 'Vàng 750 (18K)', '60.630', '62.030', '2024-11-19'),
(144, 'Giá vàng nữ trang', 'Vàng 680 (16.3K)', '54.850', '56.250', '2024-11-19'),
(145, 'Giá vàng nữ trang', 'Vàng 650 (15.6K)', '52.380', '53.780', '2024-11-19'),
(146, 'Giá vàng nữ trang', 'Vàng 610 (14.6K)', '49.080', '50.480', '2024-11-19'),
(147, 'Giá vàng nữ trang', 'Vàng 585 (14K)', '47.010', '48.410', '2024-11-19'),
(148, 'Giá vàng nữ trang', 'Vàng 416 (10K)', '33.070', '34.470', '2024-11-19'),
(149, 'Giá vàng nữ trang', 'Vàng 375 (9K)', '29.690', '31.090', '2024-11-19'),
(150, 'Giá vàng nữ trang', 'Vàng 333 (8K)', '25.980', '27.380', '2024-11-19');

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `gold_prices`
--
ALTER TABLE `gold_prices`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `gold_prices`
--
ALTER TABLE `gold_prices`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
